docs/nednt/schedule.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>New England Dynamics and Number Theory Seminar</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="nednt.css" />
      <link rel="icon" href="/favicon_phi.svg">
</head>
<body>
<div id="content" class="content">
<h1 class="title">New England Dynamics and Number Theory Seminar</h1>
<nav class="site-nav">
  <a href="./seminar-information.html">Seminar Information</a>
  <a href="./schedule.html">Schedule</a>
  <a href="./titles-abstracts.html">Titles and Abstracts</a>
  <a href="./past-semesters.html">Past Semesters</a>
</nav>

<script>
document.addEventListener("DOMContentLoaded", function () {
  let currentPath = window.location.pathname
    .replace(/\/index\.html$/, "/")
    .replace(/\/$/, "");

  document.querySelectorAll(".site-nav a").forEach(link => {
    const url = new URL(link.getAttribute("href"), document.baseURI);
    let linkPath = url.pathname
      .replace(/\/index\.html$/, "/")
      .replace(/\/$/, "");

    if (linkPath === currentPath) {
      link.classList.add("current");
      link.removeAttribute("href");
    }
  });
});
</script>
