docs/nednt/schedule.html


<div id="outline-container-orgfccde96" class="outline-2">
<h2 id="orgfccde96">Spring 2026</h2>
<div class="outline-text-2" id="text-orgfccde96">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Speaker</th>
<th scope="col" class="org-left">Affiliation</th>
<th scope="col" class="org-left">Title</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Jan29</b></td>
<td class="org-left"><a target="_blank" rel="noopener noreferrer" href="https://www.asmith-math.org/">Alexander Smith</a></td>
<td class="org-left">Northwestern University</td>
<td class="org-left">Diophantine approximation for hypersurfaces<details class="cellpop"> <summary>[i]</summary> <div class="note">Among the nondegenerate C<sup>4</sup> hypersurfaces, we characterize the rational quadrics as the hypersurfaces that are the least well approximated by rational points. For all other hypersurfaces, we give a heuristically sharp lower bound for the number of rational points near them, improving the sensitivity of prior results of Beresnevich and Huang. Our methods are dynamical, involving the application of Ratner’s theorems for unipotent orbits, and we will show how our work relates to the dynamical resolution of the Oppenheim conjecture by Margulis.</div> </details> (<a target="_blank" rel="noopener noreferrer" href="https://brandeis.zoom.us/rec/share/uzv8WeTOIZr9lDVad1_f2aOtHLu_6ov6GJOZbPGmua7R_RawZV6CXu2b2hVG7LZI.v3rL8rXlsoUVvwW3">video</a>)</td>
</tr>

<tr>
<td class="org-left"><b>Feb05</b></td>
<td class="org-left"><a target="_blank" rel="noopener noreferrer" href="https://sites.google.com/view/aleksanderskenderi/home">Alexander Skenderi</a></td>
<td class="org-left">UW Madison</td>
<td class="org-left">Asymptotically large free semigroups in Zariski dense discrete subgroups of Lie groups<details class="cellpop"><summary>[i]</summary> <div class="note">An important quantity in the study of discrete groups of isometries of Riemannian manifolds, Gromov hyperbolic spaces, and other interesting geometric objects is the critical exponent. For a discrete subgroup of isometries of the quaternionic hyperbolic space or octonionic projective plane, Kevin Corlette established in 1990 that the critical exponent detects whether a discrete subgroup is a lattice or has infinite covolume. Precisely, either the critical exponent equals the volume entropy, in which case the discrete subgroup is a lattice, or the critical exponent is less than the volume entropy by some definite amount, in which case the discrete subgroup has infinite covolume. In 2003, Leuzinger extended this gap theorem for the critical exponent to any discrete subgroup of a Lie group having Kazhdan’s property (T) (for instance, a discrete subgroup of SL(n,R), where n is at least 3). In this talk, I will present a result which shows that no such gap phenomenon holds for discrete semigroups of Lie groups. More precisely, for any Zariski dense discrete subgroup of a Lie group, there exist free, finitely generated, Zariski dense subsemigroups whose critical exponents are arbitrarily close to that of the ambient discrete subgroup. As an application, we show that the critical exponent is lower semicontinuous in the Chabauty topology whenever the Chabauty limit of a sequence of Zariski dense discrete subgroups is itself a Zariski dense discrete subgroup.</div></details> (<a target="_blank" rel="noopener noreferrer" href="https://brandeis.zoom.us/rec/share/FewPr5G_GOBxk376snoeC84l3YYSkHeMw0fOEqEeVJcMMbVuE_TWg4V3ZP_Qtw.StD6y2T0eJsHo90n">video</a>)</td>
</tr>

<tr>
<td class="org-left"><b>Feb12</b></td>
<td class="org-left">no talk</td>
<td class="org-left">no talk</td>
<td class="org-left">no talk</td>
</tr>

<tr>
<td class="org-left"><b>Feb19</b></td>
<td class="org-left">no talk</td>
<td class="org-left">no talk</td>
<td class="org-left">no talk</td>
</tr>

<tr>
<td class="org-left"><b>Feb26</b></td>
<td class="org-left">Kecheng Li</td>
<td class="org-left">Tufts University</td>
<td class="org-left">Unique equilibrium states for Viana maps for small potentials<details class="cellpop"> <summary>[i]</summary><div class="note">We study the thermodynamic formalism for Viana maps (skew products that couple an expanding circle map with a small perturbation of a quadratic map on the fibers). Working within the Climenhaga–-Thompson framework, we show that for every Hölder potential whose oscillation is below an explicit threshold, there is a unique equilibrium state. The main step is a uniform control of recurrence to the critical region in the fibers, where the derivative degenerates. This yields the pressure gap and the specification estimates needed to apply the method and removes the principal obstruction. These conclusions are robust under sufficiently small perturbations of the reference map.</div></details>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    (<a target="_blank" rel="noopener noreferrer" href="https://brandeis.zoom.us/rec/share/9ASWkPnUhUWghEdn5P_n9aDNbmB4q6TlBNtN24Po32cy8H-wtjHujIFGDteuWvTl.sKq9-kdglgcppU-a">video</a>)</td>
</tr>

<tr>
<td class="org-left"><b>Mar05</b></td>
<td class="org-left">Kavita Dhanda</td>
<td class="org-left">University of Houston</td>
<td class="org-left">Accumulation points of normalized approximations<details class="cellpop"><summary>[i]</summary><div class="note">Consider the collection of all accumulation points of normalized integer vector translates of points qα with α ∈ R<sup>d</sup> and q ∈ Z. For each normalization factor, We find the lebesgue measure of the set of α whose accumulation points are all of R<sup>d</sup> and of the complement set. In cases, where the lebesgue measure is zero, we seek finer information about Hausdorff dimensions of the corresponding sets.</div> </details>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           (<a target="_blank" rel="noopener noreferrer" href="https://brandeis.zoom.us/rec/play/7-ilt8E04iKvYOpyYemJ_fTvBWriCbkcxmqLxzS0KpzIC-nGDjj2xweKr-46MnOJJf9PQCFNphLIaq6p.nwnylHm4FZBul6-k?eagerLoadZvaPages=sidemenu.billing.plan_management&amp;accessLevel=meeting&amp;canPlayFromShare=true&amp;from=share_recording_detail&amp;continueMode=true&amp;componentName=rec-play&amp;originRequestUrl=https%3A%2F%2Fbrandeis.zoom.us%2Frec%2Fshare%2FFNnlQCJRDSoocMoFRxKi5gT38z1VLoeFn5lN9pxXpsx-xbU8ftbpDuWLD6ZT3MES.BMfKm4bh_IYLZglH">video</a>)</td>
</tr>

<tr>
<td class="org-left"><b>Mar12</b></td>
<td class="org-left">Rishi Kumar</td>
<td class="org-left">Tel Aviv University</td>
<td class="org-left">On the error bounds for visible points in some cut-and-project sets<details class="cellpop"><summary>[i]</summary><div class="note">The density of points visible from the origin in sets such as the Ammann–Beenker point set has recently attracted attention. These sets can also be viewed as a cut-and-project set. In this talk, we will present an error estimate for the density of visible points for some class of cut-and-project sets, along with related results. Joint work with Ilya and Barak.</div> </details></td>
</tr>

<tr>
<td class="org-left"><b>Mar19</b></td>
<td class="org-left">Jiajie Zheng</td>
<td class="org-left">University of North Texas</td>
<td class="org-left">Absolute-winning properties of equicontinuously-twisted badly approximable points in continued fractions and beta-transformations<details class="cellpop"><summary>[i]</summary><div class="note">It is well know that in a $&beta;$-transformation system for an integer \(\beta>0\), the set \(\{x: \liminf_{n\to\infty} \lvert T^nx-y_n \rvert >0\}\) has full Hausdorff dimension for all sequences \((y_n)\) in \([0,1)\) and in the Gauss map system \(\{x: \liminf_{n\to\infty} \lvert T^nx-0 \rvert >0\}\) also has full Hausdorff dimension. In this talk, I will introduce a dynamical approach to understanding these sets, and the new technique will allow us to strengthen the results so that the “targets’’ can be generalized to any equicontinuous sequence of functions, enabling the targets to vary by trajectories. In particular, notably this will imply the full dimension of non-recurrent points, bridging the problems of shrinking targets and Poincare recurrence.</div></details></td>
</tr>

<tr>
<td class="org-left"><b>Mar26</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><b>Apr02</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><b>Apr09</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><b>Apr16</b></td>
<td class="org-left">Alex Maldague</td>
<td class="org-left">Rice University</td>
<td class="org-left">Superrigidity of rich representations <details class="cellpop"> <summary>[i]</summary> <div class="note">In this talk, I will introduce the class of geodesically rich representations. These are representations of (real or complex) hyperbolic lattices that preserve a significant amount of the geometric structure of the associated quotient manifold. When the quotient manifold has robust geometric structure, these representations exhibit rigidity phenomena. In particular, a recent superrigidity theorem for rich representations was used to prove that finite-volume hyperbolic manifolds with infinitely many maximal totally geodesic submanifolds are arithmetic (Bader-Fisher-Miller-Stover). I will discuss a new superrigidity theorem for rich representations that efficiently recovers existing results and addresses target groups that were previously inaccessible. </div> </details></td>
</tr>

<tr>
<td class="org-left"><b>Apr23</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><b>Apr30</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><b>May07</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><b>May14</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
